tests/load/load-test.yml
# Load Testing Configuration — Project Manager
# Artillery.io config pour tester la résistance du serveur

config:
  target: "http://localhost:3000"
  phases:
    - name: "Warm up"
      duration: 30
      arrivalRate: 5
    - name: "Ramp up"
      duration: 60
      arrivalRate: 5
      rampTo: 50
    - name: "Sustained load"
      duration: 120
      arrivalRate: 50
    - name: "Spike test"
      duration: 30
      arrivalRate: 100
    - name: "Cool down"
      duration: 30
      arrivalRate: 10

  defaults:
    headers:
      Content-Type: "application/json"

  ensure:
    p95: 3000
    maxErrorRate: 5

scenarios:
  - name: "Authentification concurrente"
    weight: 30
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "admin@test.pm"
            password: "E2eLocal123!"
          expect:
            - statusCode: 200

  - name: "Navigation pages sans auth"
    weight: 20
    flow:
      - get:
          url: "/welcome"
      - get:
          url: "/login"

  - name: "Accès API protégé"
    weight: 30
    flow:
      - get:
          url: "/api/projects"
          headers:
            Authorization: "Bearer {{ $randomString() }}"
          expect:
            - statusCode: 401

  - name: "Stress rate limiter"
    weight: 20
    flow:
      - loop:
          - post:
              url: "/api/auth/login"
              json:
                email: "admin@test.pm"
                password: "wrongpassword"
              expect:
                - statusCode: [401, 429]
          - think: 100
        count: 10